<a href="https://colab.research.google.com/github/06-09-2004/Data-Science-Tutorials/blob/main/as_9_8_24.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#pandas Series
#A series in pandas is a one-dimensional array-like object that to a column in a spreadsheet or a Sql table
import pandas as pd
#Series generated from a list
a=[1,7,2]
myvar=pd.Series(a)
print(a)
print(myvar)
print('---------------------')
#labels
print(myvar[0])
print('---------------------')
#Assigning seperate labels to values in the statement
myvar2=pd.Series(a,index=["x","y","z"])
print(myvar2)
print(myvar2["y"])
print('---------------------')
#Series generated from dictionary
calories={"day1":420,"day 20":380,"day 3":390}
myvar=pd.Series(calories)
print(myvar)
print('----------------------')
myvar=pd.Series(calories,index=['day1','day2'])
print(myvar)
print('----------------------')
#series generated from Scalar Value
Series=pd.Series(5,index=[0,1,2,3])
print(Series)
print('----------------------')

[1, 7, 2]
0    1
1    7
2    2
dtype: int64
---------------------
1
---------------------
x    1
y    7
z    2
dtype: int64
7
---------------------
day1      420
day 20    380
day 3     390
dtype: int64
----------------------
day1    420.0
day2      NaN
dtype: float64
----------------------
0    5
1    5
2    5
3    5
dtype: int64
----------------------

In [ ]:
#integer Series
int_series=pd.Series([1,2,3,4])
print(int_series)
print('---------------------')
#float series
float_series=pd.Series([1.1,2.2,3.3,4.4])
print(float_series)
print('---------------------')
#String Series
string_series=pd.Series(['a','b','c','d'])
print(string_series)
print('---------------------')
#label based indexing
data={'a':10,'b':20,'c':30}
series=pd.Series(data)
print(series['a'])
print(series[['a','c']])
print('---------------------')
#Boolean indexing
data=[10,20,30,40,50]
series=pd.Series(data)
#Acsess elements greater than 25
print(series[series>25])
print('----------------------')

0    1
1    2
2    3
3    4
dtype: int64
---------------------
0    1.1
1    2.2
2    3.3
3    4.4
dtype: float64
---------------------
0    a
1    b
2    c
3    d
dtype: object
---------------------
10
a    10
c    30
dtype: int64
---------------------
2    30
3    40
4    50
dtype: int64
----------------------

In [ ]:
#Creating a Data Frame
data={
    'Name': ['Alice','Bob','Charlie'],
    'Age':[25,30,35],
    'City':['New York','Los Angeles','Chicago']
}
df=pd.DataFrame(data)
print(df)
print('-------------------')
#Selecting Columns
#column wise slicing
print(df.Name)#Both are same
print(df['Name'])#if we want only single column
print(df[['Name','City']])#if we want more than one column
print('-------------------')
#row wise slicing
df=pd.DataFrame(data)
#select a single row by label
print(df.loc[0])
#select multiple rows
print(df.iloc[0:2])
print('-------------------')

#Conditional Selection
#select rows where age is greater than 25
print(df[df['Age']>25])
print('-------------------')
print(df.loc[(df.Name=='Bob')&(df.City=='Los Angeles')])

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
-------------------
0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
-------------------
Name       Alice
Age           25
City    New York
Name: 0, dtype: object
    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles
-------------------
      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
-------------------
  Name  Age         City
1  Bob   30  Los Angeles

In [ ]:
#GroupBy in pandas
#Grouping by a single column
data={
    'name':['Alice','Bob','Charlie','Alice','Bob'],
    'age':[25,30,35,25,30],
    'city':['New York','San Francisco','Los Angeles','New York','San Francisco'],
    'salary':[70000,80000,120000,70000,80000]
}
df=pd.DataFrame(data)
grouped=df.groupby('name')
print(grouped.groups)
#calculate the sum of salaries for each group
salary_sum= grouped['salary'].sum()
print(salary_sum)
age_mean=grouped['age'].mean()
print(age_mean)
#grouping by multiple columns
#group by 'name' and 'city'
grouped_multiple=df.groupby(['name','city'])
#calculate the sum of salaries for each group
salary_sum_multiple=grouped_multiple['salary'].sum()
print(salary_sum_multiple)

{'Alice': [0, 3], 'Bob': [1, 4], 'Charlie': [2]}
name
Alice      140000
Bob        160000
Charlie    120000
Name: salary, dtype: int64
name
Alice      25.0
Bob        30.0
Charlie    35.0
Name: age, dtype: float64
name     city
Alice    New York         140000
Bob      San Francisco    160000
Charlie  Los Angeles      120000
Name: salary, dtype: int64